{"pages":[{"title":"about","text":"","link":"/about/index.html"}],"posts":[{"title":"新的开始","text":"欢迎来到Michael的神奇小屋~ 2020：新的开始2020年的开头是一段不太理想的日子，世界各国接踵而至的天灾人祸让我们失去了很多东西（不管是精神上还是物质上）。但这些阴暗的日子终究会过去，我们的生活总得继续，一切的一切，都希望有一个新的开始吧。 最早写博客是早在2017年了，那时才刚读大学，也刚刚接触软件开发，写过几篇不是那么理想的文章后，跑去考研，技术上的东西放下了好久。转眼间，大学时光马上就要结束，而我的考研之路也在几个月前止步了。经过深思熟虑，我还是决定重新走回技术这条路上来。 在此之前，我接触过Web前端开发、Java后端开发，虽然都不是学的很精，但也都算是略懂吧。而现在，在即将工作之时，我选择了一个新的方向——安卓开发。Why？可能还是因为我性格中一贯的那一条：喜欢尝试和挑战一些新的东西。不管怎么说，既然选择了，就在这条路上走下去，而且要尽我所能走的越来越好。 以前的博客碍于个人水平实在太垃圾，写的乱七八糟，这是我重新开始博客的重要初衷。其次，也是为了一个新的开始，在这条新的道路上，我希望用这个博客记录一些自己的感悟、收获和成长。这个新博客诞生的缘由，大概如此而已。 以后尽量多来写些东西，也希望自己写的能帮助到需要的人。 OK，就这样。","link":"/2020/03/21/%E6%96%B0%E7%9A%84%E5%BC%80%E5%A7%8B/"},{"title":"毕业论文排版踩坑指南（Word 2019版）","text":"最近一直忙于毕业设计和毕业论文，终于把论文初稿弄得差不多，没成想差点死在排版上，乱腾腾的页码、谜一般的分节符和分页符，简直让我万般绝望（本以为排版是什么微不足道的小事啊啊啊）。 但是，咱老张怎么能怕这点小挫折呢？于是乎，经过一晚上的各种查资料、做实验，终于把论文的排版搞定了！其实，也没多难，主要是几个坑容易让人晕掉。为了防止以后需要做论文排版的兄弟姐妹再踩在我遇到的这些，看似很弱智但却真的很折磨人的坑里，做此总结，以供大家参考。 废话不多说，上干货！ 关于分页符和分节符 如何看到分页符和分节符： 依次点击：视图-草稿，便可在草稿模式下看到分节符（delete可删除） 依次点击：文件-选项-显示-勾选显示所有格式标记，这样在页面视图模式下也可以看到包括分页符、分节符、空格等等本来不可见的“字符” 分节符的作用：分节符用来将整篇文章分为多个小节，每个小节内的页码是独立的（即第一节从1开始，第二节也是从1开始） 分页符的作用：分页符用来给文章分页，其与分节符的区别时，分页后仍属于同一小节，也就意味着页码仍然是连续的 如何添加分节符和分页符？ 布局-分隔符-分节符/分页符 关于页码 如何将不同小节的页码设置成连续模式？ 双击第二节第一页的页脚，会看到设计栏有“链接到前一节”选项，点击该选项，即可将该节的页码与上一节连续起来（即第一节为1,2,3,4,5，则第二节将从6开始） 为何我的设置完页码，只有1,3,5，却没有2,4,6？ 因为你的页脚或者页眉选择了“奇偶页不同”选项，此时需要在第一个偶数页同样设置一遍页码。 为何我的页码不是从1开始的？ 双击页脚或者页眉后，依次选择：页码-设置页码格式，然后选择起始页码为1，点击确定。然后再点击：页码-页面底端（或页面顶端），选择不同样式的页码插入即可 如何选择页码的数字形式（如阿拉伯数字或者罗马数字）？ 双击页脚或者页眉后，依次选择：页码-设置页码格式，然后选择编号格式，点击确定即可。 如何将文章的不同部分分别编码呢？（如摘要目录与正文需要分开编码） 该操作正与设置成连续模式相反，首先在两部分之间添加分节符，然后反向操作，将“链接到前一节”取消，此时，两部分的页码便是独立编码了。 关于其他 如何理解段前段后0.5行呢？ 理解个毛线，这是一种文字格式，名字就叫“段前段后0.5行”。操作：复制文字后，布局-间距，设置段前段后的行数即可 如何设置目录？ 将光标置于目标位置，依次点击：引用-目录-自动目录即可。（建议先将页码搞好，再生成目录，不然生成了页码也是乱的） 如何调出左侧的导航栏？ 视图-导航窗格","link":"/2020/05/11/%E6%AF%95%E4%B8%9A%E8%AE%BA%E6%96%87%E6%8E%92%E7%89%88%E8%B8%A9%E5%9D%91%E6%8C%87%E5%8D%97%EF%BC%88Word-2019%E7%89%88%EF%BC%89/"}],"tags":[{"name":"感悟","slug":"感悟","link":"/tags/%E6%84%9F%E6%82%9F/"},{"name":"Office办公软件","slug":"Office办公软件","link":"/tags/Office%E5%8A%9E%E5%85%AC%E8%BD%AF%E4%BB%B6/"}],"categories":[{"name":"感悟","slug":"感悟","link":"/categories/%E6%84%9F%E6%82%9F/"},{"name":"Office办公软件","slug":"Office办公软件","link":"/categories/Office%E5%8A%9E%E5%85%AC%E8%BD%AF%E4%BB%B6/"}]}